Book:`Pandas for Everyone`  
Authon:`Daniel Y. Chen`

Pandas Data Types:-  
 * Series
 * DataFrame

In [14]:
import pandas as pd
import pyreadr
# data source https://github.com/jennybc/gapminder/tree/main/data
result = pyreadr.read_r("./data/gapminder")
df = result["gapminder"]
df.head()

       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
1  Afghanistan      Asia  1957   30.332   9240934  820.853030
2  Afghanistan      Asia  1962   31.997  10267083  853.100710
3  Afghanistan      Asia  1967   34.020  11537966  836.197138
4  Afghanistan      Asia  1972   36.088  13079460  739.981106

In [15]:
type(df)

pandas.core.frame.DataFrame

### EDA

In [17]:
df.shape

(1704, 6)

In [18]:
df.columns

Index(['country', 'continent', 'year', 'lifeExp', 'pop', 'gdpPercap'], dtype='object')

In [21]:
# get the data types of each columns
df.dtypes

country      category
continent    category
year            int32
lifeExp       float64
pop             int32
gdpPercap     float64
dtype: object

In [23]:
# get more information about our data
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1704 entries, 0 to 1703
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   country    1704 non-null   category
 1   continent  1704 non-null   category
 2   year       1704 non-null   int32
 3   lifeExp    1704 non-null   float64
 4   pop        1704 non-null   int32
 5   gdpPercap  1704 non-null   float64
dtypes: category(2), float64(2), int32(2)
memory usage: 50.4 KB

In [26]:
lifeExp_df = df["lifeExp"]
lifeExp_df.tail()

1699    62.351
1700    60.377
1701    46.809
1702    39.989
1703    43.487
Name: lifeExp, dtype: float64

In [38]:
subset = df[["lifeExp","country","year"]]
# subset.iloc[10:40:2]
subset.head()

   lifeExp      country  year
0   28.801  Afghanistan  1952
1   30.332  Afghanistan  1957
2   31.997  Afghanistan  1962
3   34.020  Afghanistan  1967
4   36.088  Afghanistan  1972

#### Subset Rows by Index Label:
* loc

In [41]:
# subset based on row name and row number
# loc and iloc
df.loc[99]

country      Bangladesh
continent          Asia
year               1967
lifeExp          43.453
pop            62821884
gdpPercap    721.186086
Name: 99, dtype: object

In [44]:
type(df.loc[99])

pandas.core.series.Series

In [42]:
df.tail(n=1)

       country continent  year  lifeExp       pop   gdpPercap
1703  Zimbabwe    Africa  2007   43.487  12311143  469.709298

In [43]:
type(df.tail(n=1))

pandas.core.frame.DataFrame

In [45]:
# accessing multiple rows
df.loc[[100,200,300]]

          country continent  year  lifeExp       pop    gdpPercap
100    Bangladesh      Asia  1972   45.252  70759295   630.233627
200  Burkina Faso    Africa  1992   50.260   8878303   931.752773
300      Colombia  Americas  1952   50.643  12350771  2144.115096

#### Subset Rows by Row Number
* iloc

In [46]:
df.iloc[1]

country      Afghanistan
continent           Asia
year                1957
lifeExp           30.332
pop              9240934
gdpPercap      820.85303
Name: 1, dtype: object

In [47]:
df.iloc[-1]

country        Zimbabwe
continent        Africa
year               2007
lifeExp          43.487
pop            12311143
gdpPercap    469.709298
Name: 1703, dtype: object

In [48]:
df.iloc[[400,500,600]]

            country continent  year  lifeExp      pop     gdpPercap
400  Czech Republic    Europe  1972   70.290  9862158  13108.453600
500         Eritrea    Africa  1992   49.991  3668440    582.858510
600       Guatemala  Americas  1952   42.023  3146381   2428.237769

In [55]:
# loc and iloc together
# df.loc[[rows],[columns]] or df.iloc[[rows],[columns]]
df.loc[[100,110],['country','pop']]

        country       pop
100  Bangladesh  70759295
110     Belgium   9218400

In [57]:
df.iloc[[100,110],[0,-2]]

        country       pop
100  Bangladesh  70759295
110     Belgium   9218400

In [8]:
filtered_df = df[df['Name'].isin(['Alice', 'Bob']) & (df['Age'] > 25)]
filtered_df

  Name  Age  Salary Gender
1  Bob   30   60000   Male